<a href="https://colab.research.google.com/github/chelseykim/chelseykim/blob/main/Project_Nell_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Project Nell Assignmnet**
Chelsey Kim

October 7th, 2020

**1. What is the difference between a pandas Series and a DataFrame?**

A Pandas Series is a one-dimensional label array capale of holding data of any type. A Pandas Dataframe is two-dimensional labeled data structures with columns of potentially different types. Dataframes give you the option to pass indexes and columns to get row labels and column labels. A series is the data structure for a single column of Dataframes.

**2. Create a sample DataFrame and write a line of code for a quick statistic summary of you data in a Dataframe**

In [2]:
import numpy as np
import pandas as pd

In [ ]:
idx= pd.Index(['Atlanta', 'New York City', 'Boston', 'Chicago'])
df= pd.DataFrame({'State': ['Georiga', 'New York', 'Massachusetts', 'Illinois'],
                  'Population':[523738, 18804000, 4309000, 8865000],
                  'Size in miles squared' :[136.8,302.6,89.63,234.]}, index=idx)
df

                       State  Population  Size in miles squared
Atlanta              Georiga      523738                 136.80
New York City       New York    18804000                 302.60
Boston         Massachusetts     4309000                  89.63
Chicago             Illinois     8865000                 234.00

In [ ]:
df.describe()

         Population  Size in miles squared
count  4.000000e+00               4.000000
mean   8.125434e+06             190.757500
std    7.893662e+06              95.772024
min    5.237380e+05              89.630000
25%    3.362684e+06             125.007500
50%    6.587000e+06             185.400000
75%    1.134975e+07             251.150000
max    1.880400e+07             302.600000

**3. What are the different ways of selecting elements of a DataFrame?**

There are four main types of operators we can use to select data in DataFrame:


1.   The attribute operator **.**
2.   The index operator **[]**
3.   The **loc** operator
4.   The **iloc** operator

1. The attribute operator allows us to select a single column at a time

In [ ]:
df.Population

Atlanta            523738
New York City    18804000
Boston            4309000
Chicago           8865000
Name: Population, dtype: int64

2. The index operator allows us to select multiple columns at a time

In [ ]:
df[['State','Size in miles squared']]

                       State  Size in miles squared
Atlanta              Georiga                 136.80
New York City       New York                 302.60
Boston         Massachusetts                  89.63
Chicago             Illinois                 234.00

The index operator also allows us to select rows

In [ ]:
df[2:4]

                 State  Population  Size in miles squared
Boston   Massachusetts     4309000                  89.63
Chicago       Illinois     8865000                 234.00

3. The iloc operator allows us to slice both rows and columns

In [ ]:
df.iloc[1:4, 1:3]

               Population  Size in miles squared
New York City    18804000                 302.60
Boston            4309000                  89.63
Chicago           8865000                 234.00

4. The loc operator allows us to do the same thing as the iloc operator, except we refer to the rows and columns using the index labels and column names

Example to get the same column and rows as above:

In [ ]:
df.loc['Atlanta':'Boston', 'Population' : "Size in miles squared"]

               Population  Size in miles squared
Atlanta            523738                 136.80
New York City    18804000                 302.60
Boston            4309000                  89.63

*We can also select rows and columns based on a boolean condition, which can be used with either the [] operator or .loc operator*

In [ ]:
df[(df['Population'] > 1000000) & (df['Size in miles squared'] > 100) ]

                  State  Population  Size in miles squared
New York City  New York    18804000                  302.6
Chicago        Illinois     8865000                  234.0

The df.loc requires you to specify the columns you want for boolean expressions

In [ ]:
df.loc[(df['Population'] > 1000000) & (df['Size in miles squared'] > 100), 'Population']

New York City    18804000
Chicago           8865000
Name: Population, dtype: int64

**4. What is sorting for categorical variables in pandas DataFrame based on?**

Sorting for categorical variables in pandas DataFrame is based on how you define categories, and you can use boolean to do so.

**5. Create a pandas DataFrame containing three columns of randomly generated data. Plot the cumulative sum of each column with labels.**

In [3]:
dates = pd.date_range('20201001', periods=6)

df1= pd.DataFrame(np.random.randn(6,3), index=dates, columns=list('abc'))
df1

                   a         b         c
2020-10-01  0.182912 -1.793998 -1.989147
2020-10-02 -0.232247  1.096225 -0.824268
2020-10-03  0.886395 -1.516519  0.764956
2020-10-04 -0.738143 -0.081811  1.256061
2020-10-05  0.396018 -0.669666 -0.083388
2020-10-06 -1.080680  1.203927 -1.022988

In [ ]:
df1.cumsum()

                   a         b         c
2020-10-01  0.437366  0.027066  1.060701
2020-10-02  0.842973  0.890918  1.475862
2020-10-03  0.584768  1.117447  1.490997
2020-10-04 -0.602453  1.464925 -0.090724
2020-10-05 -0.205528  1.746175  0.038090
2020-10-06 -0.781498  1.461806 -1.032917

**6. List the age of each gender with the highest weight from the following DataFrame.**

In [5]:
df2 = pd.DataFrame({'Name': 'Alex Tom Steve Clarke Sarah'.split(),
                   'Age': [23, 18, 30, 20, 45],
                   'weight': [151, 140, 180, 124, 120],
                   'Gender': ['Male'] * 3 + ['Female'] * 2})

In [6]:
df3 = df2.sort_values(by=['weight', 'Gender'], ascending=False)
df3

     Name  Age  weight  Gender
2   Steve   30     180    Male
0    Alex   23     151    Male
1     Tom   18     140    Male
3  Clarke   20     124  Female
4   Sarah   45     120  Female

In [9]:
#To ensure we are picking the correct data for the highest weight for each gender
df3.groupby('Gender')['weight'].max()

Gender
Female    124
Male      180
Name: weight, dtype: int64

In [7]:
df3.loc[[2,3], 'Age']

2    30
3    20
Name: Age, dtype: int64

**7. Replace the weight values higher than 150 with the mean value of weights in the DataFrame from the previous question.**

In [11]:
df2.loc[df2['weight'] > 150, 'weight'] = df2['weight'].mean()
df2

     Name  Age  weight  Gender
0    Alex   23   143.0    Male
1     Tom   18   140.0    Male
2   Steve   30   143.0    Male
3  Clarke   20   124.0  Female
4   Sarah   45   120.0  Female

**8. Create a value counts column and reassign back to the following DataFrame.**

In [12]:
df4 = pd.DataFrame({'Animal': 'cat dog dog dog fish'.split(),
                 'weight': [8, 10, 12, 11, 2]})

z=pd.DataFrame(df4.value_counts().reset_index(name='count'))
z

  Animal  weight  count
0   fish       2      1
1    dog      12      1
2    dog      11      1
3    dog      10      1
4    cat       8      1